## 3. Ordinal Number Encoding

In [1]:
import datetime

In [2]:
today_date=datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2023, 3, 28, 23, 39, 48, 124667)

In [4]:
today_date-datetime.timedelta(2)

datetime.datetime(2023, 3, 26, 23, 39, 48, 124667)

In [5]:
## List Comprehension
days=[today_date-datetime.timedelta(x) for x in range(0,15)]
days

[datetime.datetime(2023, 3, 28, 23, 39, 48, 124667),
 datetime.datetime(2023, 3, 27, 23, 39, 48, 124667),
 datetime.datetime(2023, 3, 26, 23, 39, 48, 124667),
 datetime.datetime(2023, 3, 25, 23, 39, 48, 124667),
 datetime.datetime(2023, 3, 24, 23, 39, 48, 124667),
 datetime.datetime(2023, 3, 23, 23, 39, 48, 124667),
 datetime.datetime(2023, 3, 22, 23, 39, 48, 124667),
 datetime.datetime(2023, 3, 21, 23, 39, 48, 124667),
 datetime.datetime(2023, 3, 20, 23, 39, 48, 124667),
 datetime.datetime(2023, 3, 19, 23, 39, 48, 124667),
 datetime.datetime(2023, 3, 18, 23, 39, 48, 124667),
 datetime.datetime(2023, 3, 17, 23, 39, 48, 124667),
 datetime.datetime(2023, 3, 16, 23, 39, 48, 124667),
 datetime.datetime(2023, 3, 15, 23, 39, 48, 124667),
 datetime.datetime(2023, 3, 14, 23, 39, 48, 124667)]

In [6]:
import pandas as pd
data=pd.DataFrame(days)
data.columns=['Day']

In [7]:
data.head()

                         Day
0 2023-03-28 23:39:48.124667
1 2023-03-27 23:39:48.124667
2 2023-03-26 23:39:48.124667
3 2023-03-25 23:39:48.124667
4 2023-03-24 23:39:48.124667

In [8]:
data['Day'].dt.day_name()

0       Tuesday
1        Monday
2        Sunday
3      Saturday
4        Friday
5      Thursday
6     Wednesday
7       Tuesday
8        Monday
9        Sunday
10     Saturday
11       Friday
12     Thursday
13    Wednesday
14      Tuesday
Name: Day, dtype: object

In [9]:
data['weekday']=data['Day'].dt.day_name()
data.head()

                         Day   weekday
0 2023-03-28 23:39:48.124667   Tuesday
1 2023-03-27 23:39:48.124667    Monday
2 2023-03-26 23:39:48.124667    Sunday
3 2023-03-25 23:39:48.124667  Saturday
4 2023-03-24 23:39:48.124667    Friday

In [10]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [13]:
data['Weekday_Ordinal']=data['weekday'].map(dictionary)

In [14]:
data

                          Day    weekday  Weekday_Ordinal
0  2023-03-28 23:39:48.124667    Tuesday                2
1  2023-03-27 23:39:48.124667     Monday                1
2  2023-03-26 23:39:48.124667     Sunday                7
3  2023-03-25 23:39:48.124667   Saturday                6
4  2023-03-24 23:39:48.124667     Friday                5
5  2023-03-23 23:39:48.124667   Thursday                4
6  2023-03-22 23:39:48.124667  Wednesday                3
7  2023-03-21 23:39:48.124667    Tuesday                2
8  2023-03-20 23:39:48.124667     Monday                1
9  2023-03-19 23:39:48.124667     Sunday                7
10 2023-03-18 23:39:48.124667   Saturday                6
11 2023-03-17 23:39:48.124667     Friday                5
12 2023-03-16 23:39:48.124667   Thursday                4
13 2023-03-15 23:39:48.124667  Wednesday                3
14 2023-03-14 23:39:48.124667    Tuesday                2

### Count or Frequency Encoding

In [55]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',header=None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [56]:
train_set[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [57]:
len(train_set[1].unique())

9

In [58]:
columns=[1,3,5,6,7,8,9,13]

In [59]:
train_set[columns]

,1,3,5,6,7,8,9,13
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba
...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,United-States
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,United-States
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,United-States
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,United-States
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,United-States

In [61]:
train_set=train_set[columns]
train_set.head()

,1,3,5,6,7,8,9,13
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [62]:
train_set.columns=['Employment','Degree','Status','Designation','Family_job','Color','Sex','Country']

In [63]:
train_set.head()

,Employment,Degree,Status,Designation,Family_job,Color,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [64]:
for feature in train_set.columns[:]:
    print(feature,":",len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
Family_job : 6 labels
Color : 5 labels
Sex : 2 labels
Country : 42 labels

In [68]:
country_map=train_set['Country'].value_counts().to_dict()
country_map

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' France': 29,
 ' Greece': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Cambodia': 19,
 ' Trinadad&Tobago': 19,
 ' Laos': 18,
 ' Thailand': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Honduras': 13,
 ' Hungary': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [69]:
train_set['Country']=train_set['Country'].map(country_map)
train_set.head(20)

,Employment,Degree,Status,Designation,Family_job,Color,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

#### Advantages
1. Easy to use
2. Not increasing Feature Space

#### Disadvantages
1. It will provide same weight if the frequencies are same

### 5. Target Guided Ordinal Encoding
 1. Ordering the labels according to the target.
 2. Replace the labels by the joint probability of being 1 or 0.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('titanic_train.csv.csv',usecols=['Cabin','Survived'])

In [3]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [10]:
df['Cabin'].fillna('Missing',inplace=True)

In [11]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [17]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [18]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [20]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [21]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [23]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [24]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [26]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [27]:
ordinal_label2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_label2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [28]:
df['Cabin_Ordinal_labels']=df['Cabin'].map(ordinal_label2)

In [29]:
df.head()

   Survived Cabin  Cabin_Ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

### 6. Mean Encoding

In [30]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [32]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [33]:
df['Mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)

In [34]:
df.head()

   Survived Cabin  Cabin_Ordinal_labels  Mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854